[
  {
    "id": 1,
    "name": "Reigandō",
    "location": { "lat": 32.8196, "lng": 130.6228 },
    "city": "Kumamoto",
    "country": "Japan",
    "image": "http://localhost:8080/images/reigando.jpg",
    "description": "Reigando Cave, also known as Reigando (霊厳洞), is a historical landmark steeped in the legend of the famed swordsman Miyamoto Musashi. Nestled amidst tangerine orchards, this cave served as a retreat for Musashi during his later years. Here, he is believed to have penned his legendary book, The Book of Five Rings, a treatise on swordsmanship and strategy. Visitors can explore the serene cave surroundings and witness the hundreds of weathered stone statues (Gohyaku Rakan) representing the 500 disciples of Buddha who attained enlightenment. Pay homage at the enshrined statue of Kannon, the Bodhisattva of Compassion. Reigandō offers a glimpse into the life and legacy of Miyamoto Musashi, a figure who continues to inspire swordsmen and strategists alike. There's a great restaurant halfway up to the cave, try the curry!",
    "deities": ["Kannon"],
    "features": [
      "Retreat of the legendary swordsman Miyamoto Musashi",
      "Location where he wrote The Book of Five Rings",
      "Hundreds of weathered stone statues (Gohyaku Rakan)",
      "Statue of Kannon, the Bodhisattva of Compassion"
    ],
    "souvenirs_and_charms": ["Uknown"],
    "reviews": [
      {
        "rating": 5,
        "comment": "Kibitsu Shrine is a must-visit destination in Okayama. Its historical significance and serene atmosphere make it a truly memorable experience."
      }
    ]
  },
  {
    "id": 2,
    "name": "Hachidai Jinja",
    "location": {
      "lat": 35.0125,
      "lng": 135.6733
    },
    "city": "Kyoto",
    "country": "Japan",
    "image": "http://localhost:8080/images/hachidai.jpg",
    "description": "Hachidai Jinja is known for its serene atmosphere and ancient rituals. It is associated with Miyamoto Musashi, a great sword master who passed by on his way to duel the Yoshioka school. The shrine is serene with lush greenery and is made of bisha wood. It is located within walking distance of Ichijoji Sagarimatsu (an ancient pine) as well as Shisendo and Enko-ji temples. ",
    "deities": [
      "Eight Dragon Kings (Hachidai Ryujin)",
      "Hachidaitenno (Eight Guardian Deities)",
      "Susanoo-no-Mikoto",
      "Inari"
    ],
    "features": ["Torii gates", "Traditional wooden architecture (Bisha wood)"],
    "souvenirs_and_charms": [
      "Omamori (Protection Charms)",
      "Ema (Votive Tablets)",
      "Ofuda (Talismans)",
      "Goshuin (calligraphy)"
    ],
    "reviews": [
      {
        "rating": 5,
        "comment": "I was here for the new years celebrations and the food stalls were amazing!"
      }
    ]
  },
  {
    "id": 3,
    "name": "Atago Jinja",
    "location": {
      "lat": 35.0135,
      "lng": 135.7667
    },
    "city": "Kyoto",
    "country": "Japan",
    "image": "http://localhost:8080/images/atago.jpg",
    "description": "Atop Mount Atago, shrouded in mystery and commanding breathtaking views of Kyoto, lies Atago Jinja.  This revered Shinto shrine isn't just a scenic destination; it's a guardian spirit, fiercely protecting Kyoto from the wrath of fire.  Challenge yourself with the steep hike to the summit, and be rewarded with panoramic vistas of the ancient city sprawling beneath you.  Once you reach the shrine, soak in the serene atmosphere and feel the weight of history as you pay respects to the deity who safeguards Kyoto from flames.",
    "deities": ["Atago Gongen"],
    "features": [
      "Guardian of Kyoto from fire (cultural significance)",
      "Breathtaking panoramic views of Kyoto",
      "Challenging hike (over 1000 steps) and serene escape"
    ],
    "souvenirs_and_charms": [
      "Omamori (Protection Charms)",
      "Ema (Votive Tablets)",
      "Ofuda (Talismans)",
      "Engimono (Good Luck Charms)",
      "Fire Prevention Charms"
    ],
    "reviews": [
      {
        "rating": 5,
        "comment": "I was here for the new years celebrations and the food stalls were amazing!"
      }
    ]
  },
  {
    "id": 4,
    "name": "Yuki Jinja",
    "location": { "lat": 35.1306, "lng": 135.765 },
    "city": "Kyoto",
    "country": "Japan",
    "image": "http://localhost:8080/images/yuki.jpg",
    "description": "Tucked away on sacred Mount Kurama, Yuki Shrine beckons with serenity and ancient power. Nestled amidst a vibrant tapestry of green, the shrine offers a tranquil escape, perfect for those seeking a spiritual connection with nature. Towering over the main hall is a majestic sight - a colossal 53-foot cedar tree, standing sentinel for over 800 years. Believed to be a powerful kami (spirit) attractor, its presence adds an air of mystique to the environment.",
    "deities": ["Sarutahiko no Mikoto", "Ukanomitama no Mikoto"],
    "features": [
      "800-year-old, 53-foot cedar tree",
      "Sōjōbō, the god of all Tengu (mountain spirits)",
      "Annual Water Festival (cleansing rituals and celebrations)",
      "Kurama Fire Festival (blaze of purification around October 22nd)"
    ],
    "souvenirs_and_charms": [
      "Omamori (Protection Charms)",
      "Ema (Votive Tablets)",
      "Ofuda (Talismans)",
      "Good Luck Charms"
    ],
    "reviews": [
      {
        "rating": 5,
        "comment": "The hike up to the shrine is beautiful and peaceful. The shrine itself is serene and offers a great spiritual experience."
      }
    ]
  },
  {
    "id": 5,
    "name": "Ikoma Jinja",
    "location": { "lat": 35.1306, "lng": 135.765 },
    "city": "Ikoma",
    "country": "Japan",
    "image": "http://localhost:8080/images/ikomataisha.jpg",
    "description": "Ikoma Jinja, also known as Ikoma Taisha (Ikoma Grand Shrine), is rich with history dating back to ancient times. The exact date of its founding remains unclear, but historical records indicate its existence before the year 700.  This shrine holds significance as one of the oldest in the Ikoma region and is revered as a guardian deity of the area. The enshrined deities include Ikoma Take Mikazuchi-no-Mikoto, associated with thunder and protection, and Futsunushi-no-Mikoto, a kami of agriculture and martial prowess. It is said to house the sacred mandala (diagram) of Mount Ikoma. The shrine also plays a role in the imperial family's Daijosai ceremony, a grand enthronement ritual, where wood from the shrine's forest is used as sacred firewood.",
    "deities": ["Take Mikazuchi-no-Mikoto", "Futsunushi-no-Mikoto"],
    "features": [
      "Houses the sacred mandala of Mount Ikoma",
      "Fire festival in October"
    ],
    "souvenirs_and_charms": [
      "Omamori (Protection Charms)",
      "Ema (Votive Tablets)",
      "Ofuda (Talismans)",
      "Good Luck Charms"
    ],
    "reviews": [
      {
        "rating": 5,
        "comment": "The hike up to the shrine is beautiful and peaceful. The shrine itself is serene and offers a great spiritual experience."
      }
    ]
  },
  {
    "id": 6,
    "name": "Wakakusayama",
    "location": { "lat": 35.1306, "lng": 135.765 },
    "city": "Nara",
    "country": "Japan",
    "image": "http://localhost:8080/images/wakakusayama.jpg",
    "description": "Wakakusayama, also known as Mount Wakakusa, is a grassy mountain offering panoramic views of Nara City and a unique cultural experience. Standing at approximately 342 meters tall, this mountain is a great spot for hiking and sightseeing. During the late winter months (usually January), Wakakusayama plays host to the spectacular Wakakusayama Yamayaki festival. This traditional event involves setting the dry grass on the mountainside ablaze in a controlled burn, creating a fiery spectacle visible from all over Nara. The tradition supposedly originated from a boundary dispute between two temples, Tōdai-ji and Kōfuku-ji in 1760; it is said after mediation failed, the entire mountain was set ablaze. If you're leaving at night during this festival, you can see the burn from the JR train. Throughout the year, visitors can explore the walking trails that wind up the mountainside, enjoying the verdant scenery and fresh air. A midway point offers a rest area and a breathtaking vista of the city below. For those seeking a challenge, the summit provides even more expansive views.",
    "deities": ["Take Mikazuchi-no-Mikoto", "Futsunushi-no-Mikoto"],
    "features": [
        "Taking in the panoramic views of Nara City",
        "Having a picnic lunch at the midway point",
        "Challenging yourself with a hike to the summit"
    ],
    "souvenirs_and_charms": [
      "None specifically on the mountain but there is an alley of shops with related merchandise near the bottom of the mountain."
    ],
    "reviews": [
      {
        "rating": 5,
        "comment": "The hike up to the shrine is beautiful and peaceful. The shrine itself is serene and offers a great spiritual experience."
      }
    ]
  },
  {
    "id": 7,
    "name": "Saki Jinja",
    "location": { "lat": 34.6847, "lng": 135.8118 },
    "city": "Nara",
    "country": "Japan",
    "image": "http://localhost:8080/images/sakicho.jpg",
    "description": "Saki Jinja, a hidden gem nestled in Nara City, is steeped in history and agricultural significance.  It's considered one of the fifteen major shrines (Junisha) in Nara. Originally, a temple called Chosho-ji, founded by Imperial Prince Takagaku during the Heian period, stood near the shrine's current location. Saki Jinja served as the guardian of that temple. The shrine's location in the Sakicho district, once known as Sakiki Village, reflects the shrine's deep connection to the area's agricultural roots. You'll find kofun (ancient Japanese burial mounds dating from the 3rd to the 6th centuries) as well as rice paddies nearby.",
    "deities": [
      "Amagiya-no-Mikoto",
      "Tsunetsu-nushi-kami",
      "Rokugoken-no-Mikoto",
      "Oshikami-no-Kami and Nakatsuhiko-no-Kami (Gods of Agriculture and Harvest)",
      "Gods related to the Fujiwara clan, Mononobe clan, and the imperial family"
    ],
    "souvenirs_and_charms": [
      "This shrine is only open on certain days of the year so at present it is unknown if there are items available."
    ],
    "reviews": [
      {
        "rating": 5,
        "comment": "Saki Jinja is a hidden gem in Nara. The shrine's tranquil atmosphere and beautiful surroundings make it a perfect place for contemplation and relaxation."
      }
    ]
  },
 
  {
    "id": 8,
    "name": "Naratsuhiko Jinja",
    "location": { "lat": 34.6812, "lng": 135.8282 },
    "city": "Nara",
    "country": "Japan",
    "image": "http://localhost:8080/images/naratsuhiko.jpg",
    "description": "Located along the old Nara Highway at the northern end of the city, it's considered a gateway to Nara. The vermilion-lacquered Kasuga-zukuri style main hall and dance hall stand out within the precincts. A pond dedicated to Benzaiten-sama (goddess of beauty and fortune) graces the grounds, alongside statues representing Seven Lucky Gods. The true hidden treasure lies at the back of the shrine grounds - a giant camphor tree designated as a natural monument, estimated to be 1300 years old. This ancient marvel adds a mystical touch and is popular among those seeking power spots. The shrine has endured challenging times throughout history, including the Nanbokucho era, and is cherished by the local community. Reservations can be made for a guided tour that includes the shrine and a museum.",
    "deities": ["Shiki-no-miko"],
    "features": ["Camphor Tree"],
    "events_and_festivals": ["Okinai Dance in October"],
    "souvenirs_and_charms": [
      "Omamori (Protection Charms)",
      "Ema (Votive Tablets)",
      "Goshuin (calligraphy)"
    ],
    "reviews": [
      {
        "rating": 4,
        "comment": "Nara Hanazono Jinja is a charming shrine with a serene atmosphere. The torii gates and fox statues add to its beauty."
      }
    ]
  },
  {
    "id": 9,
    "name": "Okita Jinja",
    "location": { "lat": 34.6907, "lng": 133.9195 },
    "city": "Okayama",
    "country": "Japan",
    "image": "http://localhost:8080/images/okita.jpg",
    "description": "Okita Shrine is a historic Shinto shrine located in Okayama City. Nestled by the Hyakuken River, it enshrines a princess who was offered to a white snake/dragon in return for a cease to the flooding of Okayama city. One of the shrine buildings has a beautiful and impressively large shimenawa (ropes made of rice straw or hemp to ward off evil spirits). This shrine is particularly beloved by locals and is great for children as it has an abundance of themed charms including Dragon-Ball and Hello Kitty.",
    "deities": ["Amaterasu", "Susanoo-no-Mikoto"],
    "features": ["Main Hall (Honden)", "Torii Gate", "Garden"],
    "souvenirs_and_charms": [
      "Omamori (Protection Charms)",
      "Ema (Votive Tablets)",
      "Local Handicrafts"
    ],
    "reviews": [
      {
        "rating": 4,
        "comment": "Okita Shrine is a peaceful and picturesque spot in Okayama. The garden is particularly beautiful."
      }
    ]
  },
  {
    "id": 10,
    "name": "Musashi Jinja",
    "location": { "lat": 34.5975, "lng": 133.8865 },
    "city": "Mimasaka",
    "country": "Japan",
    "image": "http://localhost:8080/images/musashi.jpg",
    "description": "Established in 1971, Musashi Jinja in Mimasaka, Okayama, honors Miyamoto Musashi, the legendary swordsman and author of The Book of Five Rings. Musashi's birthplace attracts history and martial arts enthusiasts with its serene atmosphere amidst the beauty of the Kansai region. Visitors come to pay respects, seek inspiration for success in academic pursuits and athletic endeavors, and explore the nearby Musashi Museum. For a deeper immersion, the Musashi Budokan offers kendo practice under a striking kabuto-dome, while a traditional ryokan with a rejuvenating public bath provides a tranquil retreat. Those seeking to train in the martial arts can hone their skills at a dojo adorned with portraits of Hyoho Niten Ichi Ryu grandmasters, the unique two-sword style Musashi himself created.",
    "deities": ["Miyamoto Musashi's spirit enshrined"],
    "features": ["Torii Gate"],
    "souvenirs_and_charms": [
      "There is a village souvenir shop located near the base of the shrine."
    ],
    "reviews": [
      {
        "rating": 11,
        "comment": "One of the more beautiful and secluded places in Japan. The view from the doors of the main building is unforgettable."
      }
    ]
  },
  {
    "id": 11,
    "name": "Kibitsu Jinja",
    "location": { "lat": 34.6707, "lng": 133.8506 },
    "city": "Okayama",
    "country": "Japan",
    "image": "http://localhost:8080/images/kibitsu.jpg",
    "description": "Kibitsu Jinja is a historic Shinto shrine complex steeped in legend, architectural beauty, and natural wonder. Once the main shrine for the entire Kibi Province, it became the guardian of Bitchu Province (modern Okayama) after the region's division. Nestled at the foot of Mount Kibi-Nakayama, the shrine's grounds offer a tranquil escape. A majestic 600-year-old ginkgo tree stands sentinel, its leaves turning a vibrant yellow each November. Kibitsu Jinja isn't just a single shrine, but a shrine complex that tells a rich story. Explore the enchanting peony garden, bursting with color in spring, or wander through the serene hydrangea garden during the summer months. Hundreds of lanterns illuminate the pathways, casting a magical glow at night, creating a truly atmospheric experience. There's even an on-site kyu-dojo (archery).",
    "deities": ["Kibi-no-Omi-no-Mikoto", "Susanoo-no-Mikoto"],
    "features": ["Main Hall (Honden)", "Torii Gate", "Kibitsu-zuka Mound"],
    "souvenirs_and_charms": [
      "Omamori (Protection Charms)",
      "Ema (Votive Tablets)",
      "Local Handicrafts",
      "Goshuin (calligraphy)"
    ],
    "reviews": [
      {
        "rating": 5,
        "comment": "Kibitsu Shrine is a must-visit destination in Okayama. Its historical significance and serene atmosphere make it a truly memorable experience."
      }
    ]
  },
  {
    "id": 12,
    "name": "Ikukunitama Jinja",
    "location": { "lat": 34.6651, "lng": 135.5128 },
    "city": "Osaka",
    "country": "Japan",
    "image": "http://localhost:8080/images/ikukunitama.jpg",
    "description": "Ikunitama Shrine is a mere 15-minute walk from the vibrant Dotonbori district. Renowned as the oldest shrine in Osaka, Ikunitama Shrine offers a powerful source of blessings, particularly for matchmaking, severing unwanted relationships, fostering harmonious connections, and safeguarding women. A shrine complex, it boasts a network of eleven smaller shrines, each dedicated to a specific deity. Find blessings for entertainment (perfect for aspiring performers!), success in business, and even a guardian for home construction. One particularly popular sub-shrine is Shigino Shrine, revered by the historical figure Yodo. Interestingly, all enshrined deities are female, solidifying its enduring appeal as a source of spiritual support for women.  If you visit during July 11th and 12th, you might even witness the electrifying Ikunitama Festival, a major summer celebration alongside the renowned Tenjin and Sumiyoshi festivals, further enriching your cultural experience in Osaka.",
    "deities": ["Ikushima-no-Okami", "Kunishima-no-Okami"],
    "features": [
      "Momoyama period architectural style",
      "Torii Gate",
      "Kibitsu-zuka Mound"
    ],
    "souvenirs_and_charms": [
      "Omamori (Protection Charms)",
      "Ema (Votive Tablets)",
      "Local Handicrafts",
      "Goshuin (calligraphy)"
    ],
    "reviews": [
      {
        "rating": 5,
        "comment": "Kibitsu Shrine is a must-visit destination in Okayama. Its historical significance and serene atmosphere make it a truly memorable experience."
      }
    ]
  },
  {
    "id": 15,
    "name": "Kamishikimi Kumanoimas Jinja",
    "location": { "lat": 34.6677, "lng": 135.5127 },
    "city": "Takamori",
    "country": "Japan",
    "image": "http://localhost:8080/images/kamishikimi.jpg",
    "description": "Kamishikimi Kumanoimasu is an atmospheric Shinto shrine shrouded in mystery and natural beauty. Nestled amidst the cypress forests surrounding Takamori, a small town at the foot of Mount Aso, the shrine offers a tranquil escape. Nearly 100 moss-covered stone lanterns line the steps leading up to the main hall, creating a captivating and almost otherworldly atmosphere.  The shrine is dedicated to the creator gods Izanagi-no-Mikoto and Izanami-no-Mikoto, according to local legends. Behind the main hall, a path leads to a large sacred stone called Ugetoiwa, featuring a mysterious 10-meter hole. Legend attributes this hole to a demon's escape, symbolizing the ability to overcome any difficulty. Kamishikimi Kumanoimasu Shrine is believed to bring good luck in marriage, making it a popular destination for couples seeking blessings.",
    "deities": ["Izanagi-no-Mikoto", "Izanami-no-Mikoto"],
    "features": [
      "Nearly 100 moss-covered stone lanterns lining the path",
      "Ugetoiwa, the sacred stone with a legendary hole",
      "Symbol of overcoming difficulties",
      "Believed to bring good luck in marriage"
    ],
    "souvenirs_and_charms": [
      "Omamori (Protection Charms)",
      "Goshuin (calligraphy)",
      "Omikuji (fortunes)",
      "Ofuda (talismans)"
    ],
    "reviews": [
      {
        "rating": 5,
        "comment": "Kibitsu Shrine is a must-visit destination in Okayama. Its historical significance and serene atmosphere make it a truly memorable experience."
      }
    ]
  },
  {
    "id": 14,
    "name": "Ujigami Jinja",
    "location": { "lat": 34.8919, "lng": 135.8113 },
    "city": "Uji",
    "country": "Japan",
    "image": "http://localhost:8080/images/ujigami.jpg",
    "description": "Ujigami Jinja is a hidden gem steeped in history, awaiting discovery across the Uji River from the captivating Byodo-in Temple. This Shinto shrine holds the prestigious title of the oldest original shrine structure remaining in Japan, with its founding estimated around 1060! Ujigami Jinja served as a dedicated guardian for the nearby Byodo-in Temple for centuries. Recognized as a UNESCO World Heritage Site, the shrine's honden (main hall) reflects the classic nagare-zukuri architectural style, known for its gracefully curved and asymmetrical roof. Immerse yourself in the tranquility as you ascend Mount Uji, either by scenic cable car or a challenging yet rewarding staircase. Your journey culminates at this spiritual haven, where breathtaking panoramic views and a profound sense of history intertwine to create a truly unforgettable experience. If you're taking the JR from Kyoto station make sure to sit on the left hand side to get the best view of the Uji mountains as you approach Uji station.",
    "deities": ["Emperor Ōjin", "Uji no Wakiiratsuko", "Emperor Nintoku"],
    "features": [
      "Oldest original Shinto shrine structure in Japan (estimated 1060)",
      "Guardian shrine for Byodo-in Temple",
      "Nagare-zukuri style honden (main hall)",
      "Scenic location on Mount Uji"
    ],
    "souvenirs_and_charms": [
      "Omamori (Protection Charms)",
      "Goshuin (calligraphy)"
    ],
    "reviews": [
      {
        "rating": 5,
        "comment": "Kibitsu Shrine is a must-visit destination in Okayama. Its historical significance and serene atmosphere make it a truly memorable experience."
      }
    ]
  },
  {
    "id": 15,
    "name": "Itto Seki",
    "location": { "lat": 34.7264, "lng": 135.9598 },
    "city": "Yagyū",
    "country": "Japan",
    "image": "http://localhost:8080/images/ittoseki.jpg",
    "description": "Itto-seki, literally meaning 'one-sword cut', is a massive split boulder located in the picturesque Yagyu countryside. Legend attributes the split to the legendary swordsman Yagyu Muneyoshi (also known as Sekishūsai), who sliced the rock in one swift stroke during his training.  The mysterious boulder has become a popular pilgrimage site, especially for fans of the anime and manga series 'Demon Slayer' (Kimetsu no Yaiba), due to a similar scene involving a split rock.  Visitors can admire the impressive size and clean split of the Itto-seki, and immerse themselves in the local legends surrounding this historical landmark. Visit Amenoiwatate Jinja on your way to the boulder.",
    "deities": ["NA"],
    "features": [
      "Legendary split attributed to swordsman Yagyu Muneyoshi",
      "Popular pilgrimage site for anime fans (Demon Slayer)",
      "Massive boulder with a clean split",
      "Scenic location in Yagyu countryside"
    ],
    "souvenirs_and_charms": ["Tenugui (traditional Japanese towel"],
    "reviews": [
      {
        "rating": 3,
        "comment": "It was great for a rock."
      }
    ]
  }
]
